//Указатели

#include <stdio.h>

int main()
{
	int x, y, z, a[] = { 10, 20, 30, 40, 50 }, i;

	int* p;
	char* q;
	//--------------------------------------------------------------------
	x = 10;
	p = &x;
	printf("-------------------------------------------------------\n");
	printf("x = 10; p = &x;\n");
	printf("-------------------------------------------------------\n");
	printf(" x = %d\t  &x = %p\n", x, &x);
	printf("*p = %d\t   p = %p\n", *p, p);
	printf("-------------------------------------------------------\n");
	*p = 100;
	printf("-------------------------------------------------------\n");
	printf("*p = 100;\n");
	printf("-------------------------------------------------------\n");
	printf(" x = %d\t  &x = %p\n", x, &x);
	printf("-------------------------------------------------------\n");
	p = &y;
	*p = 1000;
	printf("p = &y; *p = 1000;\n");
	printf("-------------------------------------------------------\n");
	printf(" y = %d\t  &y = %p\n", y, &y);
	printf("*p = %d\t   p = %p\n", *p, p);
	printf("-------------------------------------------------------\n");
	//--------------------------------------------------------------------
	q = p;
	printf("*q = %c\t q=%p\n", *q, q);

	q = NULL;
	p == q ? printf("p == q\n") : printf("p != q\n");
	p != q ? printf("p != q\n") : printf("p == q\n");
	p > q  ? printf("p > q\n") : printf("p <= q\n");
	p < q  ? printf("p < q\n") : printf("p > q\n");

	p == NULL ? printf("p == NULL\n") : printf("p != NULL\n");//p == NULL и !p - одно и тоже
	!p        ? printf("p == NULL\n") : printf("p != NULL\n");
	q !=NULL  ? printf("q != NULL\n") : printf("q == NULL\n");
	q         ? printf("q != NULL\n") : printf("q == NULL\n");

	//--------------------------------------------------------------------
	printf("a[] = {");
	for (i = 0; i < sizeof a/sizeof *a; i++)
	{
		printf("%d, ", a[i]);
	}
	printf("\b } \n");
	//a[] = { 10, 20, 30, 40, 50 }
	p = a;//указатель настроен на массив(адрес 1 элемента массива &a[0]) p == 10

	z = *p;       printf("z = %d\t *p = %d\t p = %p\n", z, *p, p);//z = 10; *p = 10; p = &a[0]
	//разыменовали р
	z = *p + 1;   printf("z = %d\t *p = %d\t p = %p\n", z, *p, p);//z = 11; *p = 10; p = &a[0]
	//разыменовали р и прибалили 1 
	z = *(p + 1); printf("z = %d\t *p = %d\t p = %p\n", z, *p, p);//z = 20; *p = 10; p = &a[0]
	//переместились на следующий адрес массива (20) и разыменовали 
	z = ++*p;     printf("z = %d\t *p = %d\t p = %p\n", z, *p, p);//z = 11; *p = 22; p = &a[0]
	//разыменовали  указатель и увеличили его значение и значение a[0] на 1 = 11.
	z = *++p;     printf("z = %d\t *p = %d\t p = %p\n", z, *p, p);//z = 20; *p = 20; p = &a[1]
	//сдвинули указатель на следующий адрес и разименовали
	z = *p++ ;    printf("z = %d\t *p = %d\t p = %p\n", z, *p, p);//z = 20; *p = 30; p = &a[2]
	//разыменовали p а потом передвинулись по массиву вперед
	z = (*p)++;   printf("z = %d\t *p = %d\t p = %p\n", z, *p, p);//z = 30; *p = 31; p = &a[2]
	//разыменовали p а потом увеличили p на 1 
	printf("a[] = {");
	for (i = 0; i < sizeof a / sizeof * a; i++)
	{
		printf("%d, ", a[i]);
	}
	printf("\b } \n");









}