
// В доме N этажей, М подъездов, на каждом этаже К(=1) квартир
//По номеру квартиры определить:
// m - номер подъезда
// n - номер этажа
// k - порядковый номер квартиры на этаже считается слева направо
//где расположена искомая квартира
#include <stdio.h>
#include <stdlib.h>
#include <locale.h>

int main()
{
    int N = 5;//этажей
    int M = 3;//подъездов
    int K = 1;//количество квартир на этаже
    int m;    //номер подъезда
    int n;    //номер этажа
    int k;    // порядковый номер квартиры
    int dom[N][M];
    setlocale(LC_ALL, "Russian");
//----------------------------------------------------------------
    for(int i = 1; i <= N; i++)
    {
        for(int j = 1; j <= M; j++)
        {
            if(j==1)
                dom[i][j]= i;

            dom[i][j] = (j -1 ) * N + i;
        }
    }
//----------------------------------------------------------------
    int t = N;
    int tmp = 0;
    for(int i = 1; i <= N/2; i++)
    {
        for(int j = 1; j <= M; j++)
        {
            tmp       = dom[i][j];
            dom[i][j] = dom[t][j];
            dom[t][j] = tmp;
        }
         t--;
    }
//----------------------------------------------------------------
    for(int i = 1; i <= N; i++)
    {
        for(int j = 1; j <= M; j++)
        {
            printf("%2d ",dom[i][j]);
        }
        printf("\n");
    }
//----------------------------------------------------------------

printf("\nВ доме этажей %d, подъездов %d,на каждом этаже квартир %d\n", N,M,K);
do
{
    printf("Введите номер интересующей вас квартиры: ");
    fflush(stdin);//очищаем буфер потока(в данном случае клавиатуры)
}while(
       ((scanf("%d", &k)!= 1) && (printf("Надо вводить число\n")))
              || ((k <= 0)    && (printf("Надо вводить положительное число\n")))
              || ((k > N * M) && (printf("Надо вводить положительное число не больше %d \n", N * M))));

//----------------------------------------------------------------
for(int i = N; i >= 1 ; i--)
    {
        for(int j = 1; j <= M; j++)
        {
            if(k ==dom[i][j])
            {
                n = j;
                m = N - i + 1;
            }
        }
    }
//----------------------------------------------------------------
/*
m = (k - 1)/(N - 1);
n = (k - 1)%(N - 1);
*/

//----------------------------------------------------------------

printf("Квартира номер %d находиться в %d подъезде на %d этаже \n", k, n,m);

    return 0;
}
